<?php

use yii\db\Migration;

/**
 * Handles the creation of table `{{%news_content}}`.
 */
class m200822_072258_create_news_content_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $tableOptions = null;
        if ($this->db->driverName === 'mysql') {
            // http://stackoverflow.com/questions/766809/whats-the-difference-between-utf8-general-ci-and-utf8-unicode-ci
            $tableOptions = 'CHARACTER SET utf8 COLLATE utf8_unicode_ci ENGINE=InnoDB';
        }

        $this->createTable('{{%news_content}}', [
            'id' => $this->primaryKey(),
            'title' => $this->string(255)->unique()->notNull(),
            'banner' => $this->text(),
            'content' => $this->text()->notNull(),
            'created_by' => $this->integer(),
            'created_at' => $this->integer(),
            'updated_by' => $this->integer(),
            'updated_at' => $this->integer(),
            'news_type_id' => $this->integer(),
        ], $tableOptions);

        $this->addForeignKey(
            'fk-news_content-news_type_id',
            'news_content',
            'news_type_id',
            'news_type',
            'id',
            'CASCADE'
        );

        $this->insert('news_content', [
            'title' => 'ทีโอที ยกระดับความโปร่งใสในการปฎิบัติตามมาตรฐาน ITA เสริมสร้างคุณธรรมและธรรมาภิบาล',
            'content' => '<p>ทีโอที ยกระดับความโปร่งใสในการปฎิบัติตามมาตรฐาน ITA เสริมสร้างคุณธรรมและธรรมาภิบาล
            ทีโอที ยกระดับความโปร่งใสในการปฎิบัติตามมาตรฐาน ITA เสริมสร้างคุณธรรมและธรรมาภิบาล ภายในองค์กร
            ป.ป.ช. เปิดคะแนนคุณธรรม-ความโปร่งใสภาพรวมหน่วยงานรัฐ ทีโอที เป็น 1 ใน 13% ของหน่วยงานภาครัฐ ที่ผ่านเกณฑ์ประเมิน ITA ปี 2563 นี้ ในระดับ A (89.46 คะแนน)</p><br/>
            <p>
            นายมรกต เธียรมนตรี รักษาการกรรมการผู้จัดการใหญ่ บมจ.ทีโอที กล่าวว่า การประเมินคุณธรรมและความโปร่งใสในการดำเนินงานของหน่วยงานภาครัฐ (Integrity and Transparency Assessment: ITA) เป็นการประเมินที่มีจุดมุ่งหมายที่ก่อให้เกิดการพัฒนาและปรับปรุงด้านคุณธรรมและความโปร่งใสสำหรับการดำเนินงานของหน่วยงานภาครัฐทั่วประเทศ โดยตามมติคณะรัฐมนตรี เมื่อวันที่ 23 มกราคม พ.ศ. 2561 มีมติเห็นชอบให้หน่วยงานภาครัฐทุกหน่วยงานต้องให้ความร่วมมือและเข้าร่วมการประเมินคุณธรรมและความโปร่งใสในการดำเนินงานของหน่วยงานภาครัฐ ในปีงบประมาณ พ.ศ.2561-2564 โดยใช้แนวทางและเครื่องมือการประเมินตามที่สำนักงาน ป.ป.ช. กำหนด และการประเมินคุณธรรมและความโปร่งใสในการดำเนินงานของหน่วยงานภาครัฐ ได้ถูกกำหนดไว้ในแผนแม่บทภายใต้ยุทธศาสตร์ชาติ ระยะ 20 ปี ประเด็นการต่อต้านการทุจริตและประพฤติมิชอบ (พ.ศ. 2561 - 2580) ซึ่งมีผลผูกพันให้หน่วยงานภาครัฐทุกแห่งจะต้องเข้าร่วมการประเมินตั้งแต่ปี พ.ศ. 2561 ไปจนถึงปี พ.ศ. 2580
            </p>
            <p>
            นายมรกต เธียรมนตรี กล่าวเพิ่มเติมว่า ทีโอที เป็นหนึ่งในรัฐวิสาหกิจภายใต้บันทึกข้อตกลงความร่วมมือ (MOU) โครงการส่งเสริมและสนับสนุนการขับเคลื่อนยุทธศาสตร์ชาติว่าด้วยการป้องกันและปราบปรามการทุจริตระยะที่ 3 (พ.ศ.2560-2564) โดยเมื่อวันที่ 28 กันยายน 2563 สำนักงานคณะกรรมการป้องกันและปราบปรามการทุจริตแห่งชาติ (ป.ป.ช.) ได้จัดงาน ITA DAY 2020 - Talks and Result Announcement พร้อมทั้งจัดเวทีสนทนาและประกาศผลการประเมินคุณธรรมและความโปร่งใสในการดำเนินงานของหน่วยงานภาครัฐ (ITA) ประจำปี งบประมาณ พ.ศ.2563 ซึ่ง ป.ป.ช. เปิดคะแนนคุณธรรมความโปร่งใสภาพรวมหน่วยงานรัฐ โดย ทีโอที เป็น 1 ในหน่วยงานภาครัฐ จำนวน 13% ที่ผ่านเกณฑ์ประเมิน ITA ปี 2563 นี้ ในระดับ A (89.46 คะแนน) อยู่ในลำดับที่ 4 ของกระทรวงดิจิทัลเศรษฐกิจและสังคม ซึ่งความสำเร็จในครั้งนี้เกิดขึ้นจากความร่วมมือของผู้บริหารและพนักงาน ทีโอที ที่ให้ความร่วมมือและให้การสนับสนุนเป็นอย่างดี ทำให้ ทีโอที สามารถก้าวสู่องค์กรดิจิทัลที่มีคุณธรรม โปร่งใส และตรวจสอบได้ และจะยังคงรักษามาตรฐานให้ดียิ่งขึ้นไปอีกทั้งในปัจจุบันและอนาคต แต่มีบางประเด็นที่ได้คะแนนไม่สูงนัก ซึ่งในการประเมินคุณธรรมและความโปร่งใสของหน่วยงานภาครัฐ (Integrity Transparency and Assessment : ITA) ประจำปี 2563 ทีโอที ให้ความสำคัญและอธิบายชี้แจงให้ผู้เกี่ยวข้องทราบถึงกระบวนการทำงานของ ทีโอที เช่นเรื่องจัดซื้อจ้าง การให้บริการตามมาตรฐานที่กำหนด เป็นต้น ทีโอที ให้ความสำคัญกับผลการประเมิน ITA อย่างมากเพราะจะเป็นการสร้างความเชื่อมั่นให้กับองค์กรภายนอกและประชาชนทั่วไปทราบถึงการบริหารงานภายใน ทีโอที ที่มีคุณธรรมและโปร่งใส ตามหลัก ธรรมาภิบาล รวมทั้งมีการดำเนินตามนโยบายต่อต้านการทุจริตและคอร์รัปชั่น</p>',
            'created_at' => time(),
            'updated_at' => time(),
            'created_by' => 1,
            'updated_by' => 1,
            'news_type_id' => 1
        ]);

        $this->insert('news_content',[
            'title' => 'รับมอบใบรับรองมาตรฐานระบบบริหารจัดการความมั่นคงปลอดภัยสารสนเทศ',
            'content' => '<p>วันที่ 28 ก.ย.63 ทีโอที สนญ.นายทินกร นาทองลาย ผู้ช่วยกรรมการผู้จัดการใหญ่สำนักโครงข่ายบรอดแบนด์และโทรศัพท์ประจำที่ รับมอบใบรับรองมาตรฐานระบบบริหารจัดการความมั่นคงปลอดภัยสารสนเทศ ISO/IEC 27001:2013 และมาตรฐานบริการด้านเทคโนโลยีสารสนเทศ ISO/IEC 20000-1:2018 สำหรับบริการ TOT Data Services บนโครงข่าย TOT MPLS จากบริษัท BSI Group (Thailand) Ltd.ซึ่งเป็นสถาบันรับรองมาตรฐานแห่งชาติจากประเทศอังกฤษ การได้ใบรับรองฯนี้ แสดงถึงความมุ่งมั่นของ ทีโอที ในการพัฒนาระบบบริหารจัดการความมั่นคงปลอดภัยสารสนเทศและบริการด้านเทคโนโลยีสารสนเทศ เพื่อเพิ่มความสามารถในการแข่งขันและสร้างความเชื่อมั่นให้แก่ลูกค้าตามมาตรฐานสากล</p>',
            'created_at' => time(),
            'updated_at' => time(),
            'created_by' => 1,
            'updated_by' => 1,
            'news_type_id' => 1
        ]);

        $this->insert('news_content', [
            'title' => 'ลูกค้า TOT e-Bill สมัครสมาชิก TOT Privilege เพียง 50 ท่านแรก รับ Voucher',
            'content' => '<div><strong>ลดโลกร้อน กับ ทีโอที<br>
            พิเศษสำหรับผู้ใช้บริการ TOT e-bill<br>
            เพียงสมัครสมาชิก TOT Privilege วันนี้<br>
            ผู้สมัคร 50 ท่านแรก รับ Voucher Tesco Lotus&nbsp;&nbsp;มูลค่า 100 บาท<br>
            ร่วมสนุกวันนี้ - 15 ต.ค. 63<br>
            ประกาศผล 23 ต.ค. 63</strong></div><div><strong><br>
            </strong><strong>กติกาการร่วมกิจกรรม</strong><br>
            1. ผู้ร่วมสนุกต้องเป็นผู้ใช้บริการรับใบแจ้งค่าใช้บริการทางอิเล็กทรอนิกส์ (e-Bill) สมัครออนไลน์ ที่&nbsp;<a href="https://www.tot.co.th/eservice"><span style="display: inline; color: #0070c0;">www.toteservice.com</span></a><br>
            2. ผู้ร่วมสนุกต้องสมัครเป็นสมาชิก &nbsp;TOT Privilege &nbsp;ในระยะเวลาจัดกิจกรรมได้ที่ Link นี้&nbsp;<a href="https://bit.ly/3iZ9YhT"><span style="display: inline; color: #0070c0;">https://bit.ly/3iZ9YhT</span></a><br>
            3. ผู้ทำถูกต้องตามกติกา 50 ท่านแรก รับ Gift Voucher Tesco Lotus &nbsp;มูลค่า 100 บาท ท่านละ 1 รางวัล/1 เลขหมาย &nbsp;<br>
            4. ขอสงวนสิทธิ์ให้แก่ผู้ที่ทำถูกต้องตามกติกาครบถ้วนเท่านั้น<br>
            * คำตัดสินของ บมจ.ทีโอที ถือเป็นที่สิ้นสุด<br>
            ** อย่าลืมกด Like Facebook TOTPrivilege เพื่อจะได้ไม่พลาดกิจกรรมต่อไปอย่ารอช้า รีบสมัครเลย...</div>',
            'created_at' => time(),
            'updated_at' => time(),
            'created_by' => 1,
            'updated_by' => 1,
            'news_type_id' => 1
        ]);

        $this->insert('news_content',[
            'title' => 'พิเศษสำหรับลูกค้า TOTmobile ระบบรายเดือน และเติมเงิน ทีโอที',
            'content' => '<div class="contentdesc tot_detailtextblock">
            <span class="txt_content3 detail"><p><img src="https://www.tot.co.th/images/default-source/news/news-2020/10/foodpanda/content.png?sfvrsn=ac661e4a_4" data-displaymode="Original" alt="content" title="content"><br>
พิเศษสำหรับลูกค้า TOTmobile ระบบรายเดือน และเติมเงิน ทีโอที ขอมอบส่วนลด 50 บาท เมื่อสั่งอาหารผ่าน App foodpanda ขั้นต่ำ 100 บาท โดยกด *9022*6*1#โทรออก และนำโค้ดมาใช้เป็นส่วนลดเมื่อสั่งอาหารผ่าน App foodpanda ตั้งแต่วันนี้ ถึง 31 ธ.ค. 63 หรือจนกว่าสิทธิ์จะหมด</p>
<div>
<p>&nbsp;</p>
<h5>เงื่อนไขการใช้สิทธิ์</h5>
<p>&nbsp;</p>
<p>1. สิทธิพิเศษสำหรับลูกค้า TOTmobile ทั้งระบบรายเดือนและระบบเติมเงิน (1เลขหมาย/1สิทธิ์/1เดือน)<br>
2. รับส่วนลด 50 บาท เมื่อสั่งอาหารขั้นต่ำ 100 บาท<br>
3. ลูกค้ากดรับสิทธิ์ USSD *9022*6*1# โทรออก แล้วได้รับ sms เป็น Code ส่วนลด และนำ Code ไปกรอกลงในแอปพลิเคชั่น foodpanda เพื่อใช้สิทธิ์ต่อการสั่ง 1 ครั้ง<br>
4. ลูกค้าสามารถกดรับสิทธิ์ได้ ตั้งแต่วันที่ 1 ตุลาคม – 31 ธันวาคม 2563 หรือหากมีจำนวนผู้รับสิทธิ์<br>
ครบ 2,000 สิทธิ์ (แล้วแต่กรณีใดเกิดก่อน)<br>
5. สงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไข โดยไม่ต้องแจ้งให้ทราบล่วงหน้า และไม่สามารถใช้ร่วมกับรายการส่งเสริมการขายหรือส่วนลดอื่นๆ ได้<br>
6. สิทธิพิเศษนี้ไม่สามารถเปลี่ยนแปลงเป็นเงินสดได้<br>
7. สิทธิพิเศษมีจำนวนจำกัด</p>
</div></span>
        </div>',
            'created_at' => time(),
            'updated_at' => time(),
            'created_by' => 1,
            'updated_by' => 1,
            'news_type_id' => 2
        ]);

        $this->insert('news_content',[
            'title' => 'รับมอบใบรับรองมาตรฐานระบบบริหารจัดการความมั่นคงปลอดภัยสารสนเทศ2',
            'content' => '<p>วันที่ 28 ก.ย.63 ทีโอที สนญ.นายทินกร นาทองลาย ผู้ช่วยกรรมการผู้จัดการใหญ่สำนักโครงข่ายบรอดแบนด์และโทรศัพท์ประจำที่ รับมอบใบรับรองมาตรฐานระบบบริหารจัดการความมั่นคงปลอดภัยสารสนเทศ ISO/IEC 27001:2013 และมาตรฐานบริการด้านเทคโนโลยีสารสนเทศ ISO/IEC 20000-1:2018 สำหรับบริการ TOT Data Services บนโครงข่าย TOT MPLS จากบริษัท BSI Group (Thailand) Ltd.ซึ่งเป็นสถาบันรับรองมาตรฐานแห่งชาติจากประเทศอังกฤษ การได้ใบรับรองฯนี้ แสดงถึงความมุ่งมั่นของ ทีโอที ในการพัฒนาระบบบริหารจัดการความมั่นคงปลอดภัยสารสนเทศและบริการด้านเทคโนโลยีสารสนเทศ เพื่อเพิ่มความสามารถในการแข่งขันและสร้างความเชื่อมั่นให้แก่ลูกค้าตามมาตรฐานสากล</p>',
            'created_at' => time(),
            'updated_at' => time(),
            'created_by' => 1,
            'updated_by' => 1,
            'news_type_id' => 2
        ]);

        $this->insert('news_content',[
            'title' => 'ทีโอที - มิวสเปซ เดินหน้าเทคโนโลยีอวกาศ ตั้งเป้าให้บริการ Space IDC หนุนธุรกิจในยุคดิจิทัล',
            'content' => '<div class="contentdesc tot_detailtextblock">
            <span class="txt_content3 detail"><p style="text-align: justify;"> <strong> </strong><strong>ทีโอที ร่วมกับ มิวสเปซ ศึกษาความเป็นไปได้ของดาวเทียมวงโคจรต่ำ เพิ่มขีดความสามารถทางการแข่งขัน พร้อมรับไลฟ์สไตล์คนยุคดิจิทัลในอนาคต ล่าสุดการยิงจรวด </strong><strong>Blue Origin</strong><strong>เพื่อทดสอบการทำงานอุปกรณ์ดิจิทัลในอวกาศ เมื่อวันที่ </strong><strong>13 </strong><strong>ตุลาคม </strong><strong>2563 </strong><strong>เวลา </strong><strong>20.35 </strong><strong>น</strong><strong>. </strong><strong>โดยภายในจรวดประกอบด้วยชุดการทดลองของ ทีโอที ที่บรรจุภายใน </strong><strong>Single Payload Locker </strong><strong>ของ </strong><strong>Blue Origin </strong><strong>คือ </strong><strong>TOT Data Center Payload </strong><strong>หลังจากนั้นนำข้อมูลที่ได้มาวิเคราะห์และขยายผลดำเนินการในขั้นตอนต่อไป<br>
<br>
</strong><strong>นายมรกต เธียรมนตรี รักษาการกรรมการผู้จัดการใหญ่ บริษัท ทีโอที จำกัด </strong><strong>(</strong><strong>มหาชน</strong><strong>) </strong><strong>กล่าวว่า</strong> จากการที่ ทีโอที ได้ลงนามบันทึกข้อตกลงร่วมมือกับ บริษัท มิว สเปซ แอนด์ แอดวานซ์ เทคโนโลยี จำกัด เพื่อศึกษาและวิจัยความเป็นไปได้และโอกาสในการดำเนินธุรกิจเทคโนโลยีไร้สายดาวเทียมวงโคจรต่ำ(LEO) โดย ทีโอที ได้จัดคณะทำงาน เพื่อดำเนินการศึกษาควบคู่กับการพัฒนาบุคคลากร ซึ่งประกอบไปด้วยผู้บริหารและพนักงาน เพื่อสร้างองค์ความรู้และขีดความสามารถในการให้บริการที่เกี่ยวข้องกับเทคโนโลยีดาวเทียมในอนาคต ตั้งเป้าหมายว่า จะเป็นผู้นำในการให้บริการและศูนย์กลางเกตเวย์ภาคพื้นดิน ในการให้บริการ Space IDCและ Space Digtal Platformในอนาคต ด้วยคุณสมบัติที่ได้เปรียบของดาวเทียมวงโคจรต่ำ ในด้านความสามารถในการเข้าถึงพื้นที่ต่างๆ จะทำได้ง่ายกว่าภาคพื้นดิน ทำให้ที่มีโอกาสอย่างมากที่จะเข้าแทนที่การใช้งานบริการบรอดแบนด์อินเทอร์เน็ตทางสาย ทำให้เกิดความเป็นไปได้ทางธุรกิจที่เกี่ยวข้อง เช่น การสร้าง Internet Data Center IoT Platform บนวงโคจรในอนาคตข้างหน้า<br>
<br>
ขณะเดียวกัน ผลจากความร่วมมือครั้งนี้ ทีโอที และ มิวสเปซ ได้ส่งอุปกรณ์ขึ้นไปทดสอบกับBlue Origin จรวดของบริษัทในเครืออเมซอน อเมริกา เมื่อค่ำวันที่ 13 ตุลาคม 2563 เวลา 20.35 น. ที่ผ่านมาทุกอย่างเสร็จสิ้นตาม Mission ขั้นตอนต่อไปหลังจากนี้ คือรอนำข้อมูลที่ได้มาวิเคราะห์และดำเนินการต่อไป ซึ่งTOT Data Center Payload เป็นชุดการทดลองของ ทีโอที ที่ ทีโอที กับ มิว สเปซ ทดลองส่งอุปกรณ์ขึ้นสู่วงโคจรระดับ Sub-orbital ด้วยจรวด New Shepard ของ Blue Origin ในเที่ยวบิน NS-13 โดยอุปกรณ์ทดลองดังกล่าวเป็น Server Payload ที่ประกอบไปด้วย Web Server, IoT (Internet of Things) Platform, Big data device ต่างๆ เพื่อการวิจัยสำหรับการพัฒนาดาวเทียมสื่อสาร Low-Earth orbit (LEO) ในอนาคต เพื่อทดแทนระบบอินเทอร์เน็ตไร้สายแบบ Broadband ในปัจจุบัน<br>
<br>
<strong>นายมรกต กล่าวเพิ่มเติมว่า </strong>การที่ ทีโอที ได้ ร่วมมือกับ มิวสเปซ การมีพาร์ทเนอร์ที่ดี มีทีมงานของ ทีโอที ที่พร้อมแสดงให้เห็นถึงศักยภาพของ ทีโอที ที่มีความพร้อมในการร่วมทำภารกิจสำคัญๆ ได้เป็นอย่างดี ทีโอที และ มิวสเปซ ต้องการผลักดันกิจการอวกาศของประเทศไทยให้มีที่ยืนในสังคมโลกในด้านกิจการอวกาศอย่างจริงจัง ไอเดียด้านการทำ Space IDC เป็นไอเดียที่จุดประกายให้กับแวดวงโทรคมนาคมไทย ทีโอที และ มิวสเปซ อยากให้ในระดับรัฐบาลให้ช่วยสนับสนุนสิ่งที่ทำ ซึ่งไม่ใช่เป็นการแข่งขันกันแต่เป็นการร่วมมือในการทำ Mission เรื่องกิจการอวกาศโดยคนไทยมีส่วนร่วม พวกเราก้าวใหญ่มาก หวังให้เป็นแรงบันดาลใจให้ฮึกเหิมก้าวไปข้างหน้าได้อีก และในอนาคตอันใกล้นี้ ทีโอที จะมีงานจากความร่วมมือกับ มิวสเปซ อย่างต่อเนื่อง<br>
<br>
<strong>นายวรายุทธ</strong><strong> </strong><strong>เย็นบำรุง</strong><strong> </strong><strong>กรรมการและ</strong><strong> </strong><strong>ประธานเจ้าหน้าที่บริหาร</strong><strong> </strong><strong>บริษัท</strong><strong> </strong><strong>มิว</strong><strong> </strong><strong>สเปซ</strong><strong> </strong><strong>แอนด์</strong><strong> </strong><strong>แอดวานซ์</strong><strong> </strong><strong>เทคโนโลยี</strong><strong> </strong><strong>จำกัด</strong><strong> </strong><strong>กล่าวว่า</strong> mu Space Corp ร่วมกับ Blue Origin ทำการส่งชุดการทดลองทั้งหมด 5 โมดูลขึ้นไปในอวกาศกับจรวด New Shepard เที่ยวบิน NS-13 ซึ่งเดินทางขึ้นสู่อวกาศในวงโคจรแบบ Sub-orbital (ไปแล้วกลับ) โดย mu Space Corp ส่งอุปกรณ์ทดลองวิทยาศาสตร์ไปพร้อมกับยาน New Shepard เที่ยวบิน NS-13 ใน Single Payload Locker และ Mini Payload Locker ทั้งหมด 5 โมดูล ขั้นตอนต่อไปเมื่อได้ข้อมูลกลับมา มิวสเปซ ร่วมกับ ทีโอที จะนำข้อมูลที่ได้มาวิเคราะห์ และนำผลที่ได้มาออกแบบอุปกรณ์ครั้งต่อไป โดย คาดจะมี Mission ที่คาดว่าจะเกิดขึ้นให้เร็วๆ นี้</p>
<br>
<br></span>
        </div>',
            'created_at' => time(),
            'updated_at' => time(),
            'created_by' => 1,
            'updated_by' => 1,
            'news_type_id' => 1
        ]);

        $this->insert('news_content',[
            'title' => 'คุณคือคนแรก เพียงสมัคร TOT fiber 2U ทางออนไลน์ ได้เน็ตแรงๆ',
            'content' => '<div class="contentdesc tot_detailtextblock">
            <span class="txt_content3 detail"><div dir="auto"><img src="https://www.tot.co.th/images/default-source/news/activity-tot-fiber-2u-sep-2020/120268145_1631265163708211_3944529041041179917_o.jpg?sfvrsn=a2c2ee4c_2" data-displaymode="Original" alt="120268145_1631265163708211_3944529041041179917_o" title="120268145_1631265163708211_3944529041041179917_o"><br>
<div><strong>ลดโลกร้อน กับ ทีโอที<br>
พิเศษสำหรับผู้ใช้บริการ TOT e-bill<br>
เพียงสมัครสมาชิก TOT Privilege วันนี้<br>
ผู้สมัคร 50 ท่านแรก รับ Voucher Tesco Lotus&nbsp;&nbsp;มูลค่า 100 บาท<br>
ร่วมสนุกวันนี้ - 15 ต.ค. 63<br>
ประกาศผล 23 ต.ค. 63</strong></div>
<div><strong><br>
</strong><strong>กติกาการร่วมกิจกรรม</strong><br>
1. ผู้ร่วมสนุกต้องเป็นผู้ใช้บริการรับใบแจ้งค่าใช้บริการทางอิเล็กทรอนิกส์ (e-Bill) สมัครออนไลน์ ที่&nbsp;<a href="https://www.tot.co.th/eservice"><span style="display: inline; color: #0070c0;">www.toteservice.com</span></a><br>
2. ผู้ร่วมสนุกต้องสมัครเป็นสมาชิก &nbsp;TOT Privilege &nbsp;ในระยะเวลาจัดกิจกรรมได้ที่ Link นี้&nbsp;<a href="https://bit.ly/3iZ9YhT"><span style="display: inline; color: #0070c0;">https://bit.ly/3iZ9YhT</span></a><br>
3. ผู้ทำถูกต้องตามกติกา 50 ท่านแรก รับ Gift Voucher Tesco Lotus &nbsp;มูลค่า 100 บาท ท่านละ 1 รางวัล/1 เลขหมาย &nbsp;<br>
4. ขอสงวนสิทธิ์ให้แก่ผู้ที่ทำถูกต้องตามกติกาครบถ้วนเท่านั้น<br>
* คำตัดสินของ บมจ.ทีโอที ถือเป็นที่สิ้นสุด<br>
** อย่าลืมกด Like Facebook TOTPrivilege เพื่อจะได้ไม่พลาดกิจกรรมต่อไปอย่ารอช้า รีบสมัครเลย...</div>
</div></span>
        </div>',
            'created_at' => time(),
            'updated_at' => time(),
            'created_by' => 1,
            'updated_by' => 1,
            'news_type_id' => 1
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable('{{%news_content}}');
    }
}
